{"title": " Saar Biotech - Povidone Iodine & Ornidazole Ointment | Contract Pharmaceuticals", "meta": ["text/html; charset=utf-8", "Povidone Iodine and Ornidazole. Povidone Iodine is an antiseptic applied on skin which is infected or is likely to get infected. It slowly releases iodine which kills or prevents the growth of infectious microorganisms. Ornidazole is an antibiotic which kills bacteria and other infectious microorganisms.", "Povidone Iodine, Ornidazole Pharmacology, ornidazole, Povidone Iodine, antiseptic, Ointment,  antibiotics, antihistamines, nasal steroids, decongestants, nasal dryness "], "name": "Ofloxacin & Metronidazole Suspension\n\n", "indications": "Indications:- Urinary tract infections, Gonorrhoea", "approved_name": "\nSUSPENSION PRESENTATION: \n\nOfloxacin 50 mg\nMetronidazole 120 mg\n \n\n\n\n \n \n      \nThe composition of ofloxacin and metronidazole which works by preventing the repairing and division of the bacteria\nAlso, it kills the parasites and anaerobic bacteria that causes infections by affecting their DNA. \n\n\n  \n \n\nPneumonitis \nUrinary tract infections\nProstatitis \nIt also treats diarrhoea \nGonorrhoea\nUseful in urethral infections \n\n\n  \n \n\nMetronidazole undergoes reduction and this reduction usually occurs in bacteria and protozoans therefore they inhibit nucleic acid synthesis by causing disruption of DNA. \nOfloxacin inhibits the enzyme topoisomerase 4 and DNA gyrase, DNA gyrase is required for the transcription, repair and replication of DNA. \n \n\n\n\n\n\n  \n \n\nIt is absorbed orally \nIt is 20% bound to serum proteins \nIt undergoes oxidation and glucuronidation \nIt is excreted via urine \n\n\n  \n \n\nContraindicated in myasthenia gravis  \n\n\n\n\n\n\n\n\nMetformin \nMetronidazole \nIbuprofen \nDoxycycline \n\n\n\n\n\n\nNumbness\nTingling \nDizziness\nNausea \nIncreased heart rate\nTingling \nBurning sensation \n\n\nDisclaimer:The data uploaded is made from content already available on internet.The company holds no right of it and is not responsible for any wrong information.  \n\n"}